const azkar = require('./src/utils/helpers/azkar.json');
const fs = require('fs');

let cat = []
let az = []
let dua = []

let azkarCuont = 0
let duaaCuont = 0

azkar.forEach(element => {
  // if (!cat.includes(element.category))

  if (element.category.startsWith('أذكار') || element.category.startsWith('الأذكار') || element.category.startsWith('الذكر')) {
    azkarCuont++
    az.push(element.category)
    element.id = "azkar"
  }
  if (element.category.startsWith('دعاء')) {
    duaaCuont++
    dua.push(element.category)
    element.id = "duaa"
  }
  if (element.category.startsWith('الدعاء')) {
    duaaCuont++
    dua.push(element.category)
    element.id = "duaa"
  }
  if (element.category.startsWith('الاستغفار')) {
    element.id = "azkar"
  }
  if (!element?.id) {
    element.id = "any"
  }
  cat.push(element.category)
});

fs.writeFileSync('./src/utils/helpers/azkar2.json', JSON.stringify(azkar, null, 2), 'utf8');

console.log(cat);
console.log(az);
console.log(dua);
console.log("cat length", cat.length);

console.log("azkar length", azkarCuont);
console.log("duaa length", duaaCuont);

[
  'أذكار الصباح',
  'أذكار المساء',
  'أذكار الاستيقاظ من النوم',
  'أذكار الآذان',
  'أذكار النوم'
]
[
  'دعاء لبس الثوب',
  'دعاء لبس الثوب الجديد',
  'دعاء لبس الثوب الجديد',
  'دعاء لبس الثوب الجديد',
  'دعاء دخول الخلاء - الحمام',
  'دعاء الخروج من الخلاء - الحمام',
  'دعاء الذهاب إلى المسجد',
  'دعاء دخول المسجد',
  'دعاء الخروج من المسجد',
  'دعاء الاستفتاح',
  'دعاء الاستفتاح',
  'دعاء الاستفتاح',
  'دعاء الاستفتاح',
  'دعاء الاستفتاح',
  'دعاء الاستفتاح',
  'دعاء الركوع',
  'دعاء الركوع',
  'دعاء الركوع',
  'دعاء الركوع',
  'دعاء الركوع',
  'دعاء الرفع من الركوع',
  'دعاء الرفع من الركوع',
  'دعاء الرفع من الركوع',
  'دعاء السجود',
  'دعاء السجود',
  'دعاء السجود',
  'دعاء السجود',
  'دعاء السجود',
  'دعاء السجود',
  'دعاء السجود',
  'دعاء الجلسة بين السجدتين',
  'دعاء الجلسة بين السجدتين',
  'دعاء سجود التلاوة',
  'دعاء سجود التلاوة',
  'دعاء صلاة الاستخارة',
  'دعاء الفزع في النوم و من بلي بالوحشة',
  'دعاء قنوت الوتر',
  'دعاء قنوت الوتر',
  'دعاء قنوت الوتر',
  'دعاء الهم والحزن',
  'دعاء الهم والحزن',
  'دعاء الكرب',
  'دعاء الكرب',
  'دعاء الكرب',
  'دعاء الكرب',
  'دعاء لقاء العدو و ذي السلطان',
  'دعاء لقاء العدو و ذي السلطان',
  'دعاء لقاء العدو و ذي السلطان',
  'دعاء من خاف ظلم السلطان',
  'دعاء من خاف ظلم السلطان',
  'دعاء من أصابه وسوسة في الإيمان',
  'دعاء من أصابه وسوسة في الإيمان',
  'دعاء من أصابه وسوسة في الإيمان',
  'دعاء قضاء الدين',
  'دعاء قضاء الدين',
  'دعاء الوسوسة في الصلاة و القراءة',
  'دعاء من استصعب عليه أمر',
  'دعاء طرد الشيطان و وساوسه',
  'دعاء طرد الشيطان و وساوسه',
  'دعاء طرد الشيطان و وساوسه',
  'دعاء المريض الذي يئس من حياته',
  'دعاء المريض الذي يئس من حياته',
  'دعاء المريض الذي يئس من حياته',
  'دعاء من أصيب بمصيبة',
  'دعاء التعزية',
  'دعاء زيارة القبور',
  'دعاء الريح',
  'دعاء الريح',
  'دعاء الرعد',
  'دعاء رؤية الهلال',
  'دعاء الضيف لصاحب الطعام',
  'دعاء الصائم إذا حضر الطعام ولم يفطر',
  'دعاء العطاس',
  'دعاء المتزوج و شراء الدابة',
  'دعاء الغضب',
  'دعاء من رأى مبتلى',
  'دعاء الخوف من الشرك',
  'دعاء كراهية الطيرة',
  'دعاء الركوب',
  'دعاء السفر',
  'دعاء دخول القرية أو البلدة',
  'دعاء دخول السوق',
  'دعاء المسافر للمقيم',
  'دعاء المقيم للمسافر',
  'دعاء المقيم للمسافر',
  'دعاء المسافر إذا أسحر',
  'دعاء نباح الكلب بالليل',
  'دعاء الوقوف على الصفا والمروة',
  'دعاء التعجب والأمر السار',
  'دعاء التعجب والأمر السار',
  'دعاء من خشي أن يصيب شيئا بعينه'
]
